# St7SetNFANumModes

Sets the number of modes to be calculated in natural frequency analysis.

Strand7 API Manual

long St7SetNFANumModes(long uID, long NumModes)

Input Parameters

uID

Strand7 model file ID.

NumModes

Number of modes.